Revit 2027 API
CurveByPoints.SetPoints Method
Change the sequence of points interpolated by this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPoints(
	ReferencePointArray points
)
Public Sub SetPoints (
	points As ReferencePointArray
)
public:
void SetPoints(
	ReferencePointArray^ points
)
member SetPoints :
        points : ReferencePointArray -> unit
Parameters
points ReferencePointArray
An array of 2 or more ReferencePoints.
Exceptions
Exception | Condition
ArgumentException | Thrown when the array contains fewer than 2 points, when the array contains duplicates, or when adjacent points are located too close together.
See Also
Reference
CurveByPoints Class
Autodesk.Revit.DB Namespace